Tekla Open API Reference for Tekla Structures 2025
Symbol.SymbolInfo Property
 Gets or sets the symbol information.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SymbolInfo SymbolInfo { get; set; }
Public Property SymbolInfo As SymbolInfo
	Get
	Set
Property Value
Type: SymbolInfo
See Also
Reference
Symbol Class
Tekla.Structures.Drawing Namespace